{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 10, "trainable": true, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.3, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 5, "trainable": true, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 9], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dense", "config": {"units": 1, "trainable": true, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}], "keras_version": "2.1.5"}